Revit 2027 API
ForgeTypeId Properties
The ForgeTypeId type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
TypeId |  The schema identifier.
Top
See Also
Reference
ForgeTypeId Class
Autodesk.Revit.DB Namespace